Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetDefaultValue Method (String)
 Gets the default value of a string property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetDefaultValue(
	ref string DefaultValue
)
Public Function GetDefaultValue (
	ByRef DefaultValue As String
) As Boolean
Parameters
DefaultValue
Type: System.String
The value that was gotten.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
GetDefaultValue Overload
Tekla.Structures.Catalogs Namespace